# loc, lic, ix

#### How do I select multiple rows and columns from a pandas DataFrame?
https://www.youtube.com/watch?v=xvpNA7bC8cs

- 위 동영상 강의 자료를 바탕으로 pandas의 loc, lic, ix에 대한 설명을 정리한 자료임
- ufo reports 자료를 사용함

In [2]:
import pandas as pd
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

# loc
- selecting column
- .loc(what rows do I want, what columns do I want)

In [6]:
# index 1 행에 있는 모든 데이터를 불러옴
ufo.loc[1, :]

City                   Willingboro
Colors Reported                NaN
Shape Reported               OTHER
State                           NJ
Time               6/30/1930 20:00
Name: 1, dtype: object

In [8]:
# index 2, 3, 5 선택
ufo.loc[[2,3,5], :]

          City Colors Reported Shape Reported State             Time
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00
5  Valley City             NaN           DISK    ND  9/15/1934 15:30

In [10]:
# index 7~13
ufo.loc[7:13, :]

        City Colors Reported Shape Reported State              Time
7       Alma             NaN           DISK    MI    7/15/1936 0:00
8    Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9    Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00
10   Fontana             NaN          LIGHT    CA   8/15/1937 21:00
11  Waterloo             NaN       FIREBALL    AL    6/1/1939 20:00
12    Belton             RED         SPHERE    SC   6/30/1939 20:00
13    Keokuk             NaN           OVAL    IA     7/7/1939 2:00

In [17]:
ufo.loc[:, 'City':'Shape Reported'].head()

                   City Colors Reported Shape Reported
0                Ithaca             NaN       TRIANGLE
1           Willingboro             NaN          OTHER
2               Holyoke             NaN           OVAL
3               Abilene             NaN           DISK
4  New York Worlds Fair             NaN          LIGHT

In [19]:
#ufo[ufo.city=='Oakland]
ufo.loc[ufo.City=='Oakland','State']

1694     CA
2144     CA
4686     MD
7293     CA
8488     CA
8768     CA
10816    OR
10948    CA
11045    CA
12322    CA
12941    CA
16803    MD
17322    CA
Name: State, dtype: object

# loc와 iloc의 차이

In [21]:
ufo.loc[0:3, :]
ufo.iloc[0:3,:] #[row(inclusive : exclusive), columns(:) ]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

# ix

In [22]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry', index_col = 'country')

In [23]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [25]:
drinks.ix['Albania', 0]

89

In [26]:
drinks.ix[1, 'beer_servings']

89

In [27]:
drinks.ix['Albania':'Andorra', 0:2]

         beer_servings  spirit_servings
country
Albania             89              132
Algeria             25                0
Andorra            245              138